In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('./dataset/air1908.csv')

In [3]:
data.head()

,Date,Time,Location,Operator,Flight #,Route,Type,Registration,cn/In,Aboard,Fatalities,Ground,Summary
0,09/17/1908,17:18,"Fort Myer, Virginia",Military - U.S. Army,NaN,Demonstration,Wright Flyer III,NaN,1,2.0,1.0,0.0,"During a demonstration flight, a U.S. Army fly..."
1,07/12/1912,06:30,"AtlantiCity, New Jersey",Military - U.S. Navy,NaN,Test flight,Dirigible,NaN,NaN,5.0,5.0,0.0,First U.S. dirigible Akron exploded just offsh...
2,08/06/1913,NaN,"Victoria, British Columbia, Canada",Private,-,NaN,Curtiss seaplane,NaN,NaN,1.0,1.0,0.0,The first fatal airplane accident in Canada oc...
3,09/09/1913,18:30,Over the North Sea,Military - German Navy,NaN,NaN,Zeppelin L-1 (airship),NaN,NaN,20.0,14.0,0.0,The airship flew into a thunderstorm and encou...
4,10/17/1913,10:30,"Near Johannisthal, Germany",Military - German Navy,NaN,NaN,Zeppelin L-2 (airship),NaN,NaN,30.0,30.0,0.0,Hydrogen gas which was being vented was sucked...

In [4]:
data.columns

Index(['Date', 'Time', 'Location', 'Operator', 'Flight #', 'Route', 'Type',
       'Registration', 'cn/In', 'Aboard', 'Fatalities', 'Ground', 'Summary'],
      dtype='object')

In [11]:
data = data[['Location','Type','Aboard','Fatalities']]

In [12]:
data.head()

,Location,Type,Aboard,Fatalities
0,"Fort Myer, Virginia",Wright Flyer III,2.0,1.0
1,"AtlantiCity, New Jersey",Dirigible,5.0,5.0
2,"Victoria, British Columbia, Canada",Curtiss seaplane,1.0,1.0
3,Over the North Sea,Zeppelin L-1 (airship),20.0,14.0
4,"Near Johannisthal, Germany",Zeppelin L-2 (airship),30.0,30.0

In [13]:
(data.isnull().any(1)).sum()  # any(1) 这一行有一个nan值就会被记为True

C:\Users\luhe\AppData\Local\Temp\ipykernel_19580\1816526387.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  (data.isnull().any(1)).sum()  # any(1) 这一行有一个nan值就会被记为True

66

In [15]:
data = data.dropna(subset=['Location','Type'])  # 保证['Location','Type']中都没有nan

In [16]:
(data.isnull().any(1)).sum()

C:\Users\luhe\AppData\Local\Temp\ipykernel_19580\4033617056.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  (data.isnull().any(1)).sum()

19

In [17]:
data.fillna(0, inplace=True) # 将nan fill为0

,Location,Type,Aboard,Fatalities
0,"Fort Myer, Virginia",Wright Flyer III,2.0,1.0
1,"AtlantiCity, New Jersey",Dirigible,5.0,5.0
2,"Victoria, British Columbia, Canada",Curtiss seaplane,1.0,1.0
3,Over the North Sea,Zeppelin L-1 (airship),20.0,14.0
4,"Near Johannisthal, Germany",Zeppelin L-2 (airship),30.0,30.0
...,...,...,...,...
5263,"Near Madiun, Indonesia",Lockheed C-130 Hercules,112.0,98.0
5264,"Near Isiro, DemocratiRepubliCongo",Antonov An-26,4.0,4.0
5265,"AtlantiOcean, 570 miles northeast of Natal, Br...",Airbus A330-203,228.0,228.0
5266,"Near Port Hope Simpson, Newfoundland, Canada",Britten-Norman BN-2A-27 Islander,1.0,1.0
5267,"State of Arunachal Pradesh, India",Antonov An-32,13.0,13.0

In [19]:
data.duplicated().sum()  # 是否有重复值

10

In [20]:
data[data.duplicated()]  # 查看重复值

                      Location                 Type  Aboard  Fatalities
33             Cleveland, Ohio    De Havilland DH-4     1.0         1.0
51             Cleveland, Ohio    De Havilland DH-4     1.0         1.0
71            Barcelona, Spain           Breguet 14     1.0         1.0
147   Over the Gulf of Finland         Junkers F-13     6.0         6.0
410                     Mexico       Lockheed Orion     1.0         1.0
701             Kunming, China         Douglas C-47     3.0         3.0
1046                 North Sea         Douglas DC-3     7.0         7.0
2208     Off Phu Quoc, Vietnam  Lockheed P-3B Orion    12.0        12.0
2771            Willow, Alaska          Piper PA-18     3.0         3.0
2863            Moscow, Russia       Tupolev TU-124    61.0        61.0

In [21]:
data.drop_duplicates(inplace=True) # 删除重复值

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5211 entries, 0 to 5267
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Location    5211 non-null   object
 1   Type        5211 non-null   object
 2   Aboard      5192 non-null   float64
 3   Fatalities  5202 non-null   float64
dtypes: float64(2), object(2)
memory usage: 203.6+ KB

In [24]:
data.head()

,Location,Type,Aboard,Fatalities
0,"Fort Myer, Virginia",Wright Flyer III,2.0,1.0
1,"AtlantiCity, New Jersey",Dirigible,5.0,5.0
2,"Victoria, British Columbia, Canada",Curtiss seaplane,1.0,1.0
3,Over the North Sea,Zeppelin L-1 (airship),20.0,14.0
4,"Near Johannisthal, Germany",Zeppelin L-2 (airship),30.0,30.0

In [25]:
data.Location.str.split(',').str[-1]  #取出国名

0                                  [Fort Myer,  Virginia]
1                              [AtlantiCity,  New Jersey]
2                  [Victoria,  British Columbia,  Canada]
3                                    [Over the North Sea]
4                           [Near Johannisthal,  Germany]
                              ...
5263                            [Near Madiun,  Indonesia]
5264                 [Near Isiro,  DemocratiRepubliCongo]
5265    [AtlantiOcean,  570 miles northeast of Natal, ...
5266     [Near Port Hope Simpson,  Newfoundland,  Canada]
5267                 [State of Arunachal Pradesh,  India]
Name: Location, Length: 5211, dtype: object

In [28]:
data.Location.str.split(',').str[-1].value_counts()[:20].index  # 空难次数前20的地区

Index([' Brazil', ' Alaska', ' Russia', ' Colombia', ' Canada', ' California',
       ' France', ' England', ' India', ' Indonesia', ' Mexico', ' China',
       ' Germany', ' Italy', ' Australia', ' Philippines', ' Spain',
       ' New York', ' USSR', ' Venezuela'],
      dtype='object')

In [31]:
s = data.Location.str.split(',').str[-1].value_counts()

In [32]:
s[:20].sum()/s.sum()  # 前20个国家的空难次数占所有空难次数的比值

0.39666090961427747

In [40]:
t = data.Type.str.split().str[0].value_counts()  # 按空格划分时，split不用给参数

In [42]:
t[:20].sum()/t.sum()  # 前20个品牌的空难次数占所有空难次数的比值

0.7299942429476108

In [45]:
data_b = data[data.Type.str.contains('Boeing')]

In [48]:
data_b.Aboard.replace(0.0, 1)  # 将Aboard中0替换成1，因为飞机上最少有一个人

137       2.0
140       2.0
206       1.0
228       3.0
231       1.0
        ...
5226     90.0
5227      3.0
5231     88.0
5251    134.0
5261      7.0
Name: Aboard, Length: 378, dtype: float64

In [49]:
((data_b.Aboard - data_b.Fatalities)/data_b.Aboard).mean()

0.24761622144180062